OpenFOAM-v2506/modules/OpenQBMM/tutorials/pbeTransportFoam/TaylorCouette/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 296.15;

boundaryField
{
    "wedge.*"
    {
        type            wedge;
    }
    innerWall
    {
        type            zeroGradient;
    }
    outerWall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            symmetry;
    }
    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
